/* RexxTelnet M5.3b local ARexx qualification */
ADDRESS REXXTELNET

'STATUS'
SAY 'M5_3B_STATUS=' RESULT

'GET RXCAPACITY'
SAY 'M5_3B_RXCAPACITY=' RESULT

'WAITFOR "login:" 10'
SAY 'M5_3B_WAITFOR_LOGIN_RC=' RC
SAY 'M5_3B_WAITFOR_LOGIN_RESULT=' RESULT

'SENDLINE "guest"'
SAY 'M5_3B_SENDLINE_RC=' RC
SAY 'M5_3B_SENDLINE_RESULT=' RESULT

'WAITFOR "WELCOME GUEST" 10'
SAY 'M5_3B_WAITFOR_WELCOME_RC=' RC
SAY 'M5_3B_WAITFOR_WELCOME_RESULT=' RESULT

'GET RXDROPPED'
SAY 'M5_3B_RXDROPPED=' RESULT

'QUIT'
SAY 'M5_3B_QUIT_RC=' RC
SAY 'M5_3B_DONE=1'
